lronaldo/cpctelera/cpctelera/tools/sdcc-3.9.3-r11351/src/sdas/asstm8/stm8mch.c
static char *Page[5] = {
    stm8pg, pg72, pg90, pg91, pg92
};

/*
 * Process a machine op.
 */
VOID
machine(mp)
struct mne *mp;
{
	struct expr e1, e2, e3;
	char *p1, *p2;
	int t1, t2, t3;
	int v1, v2, v3;
	int op, rf;

	clrexpr(&e1);
	clrexpr(&e2);
	clrexpr(&e3);
	op = (int) mp->m_valu;
	rf = mp->m_type;

	switch (rf) {
	/*
	 * S_AOP:
	 *	SUB,  CP, SBC, AND,
	 *	BCP, XOR, ADC,  OR,
	 *	ADD
	 */
	case S_AOP:
		t2 = addr(&e2);
		v2 = rcode;
		comma(1);
		t1 = addr(&e1);
		v1 = rcode;
		if ((t2 == S_REG) && (v2 == SP) &&
		    (t1 == S_IMM)) {
			if (op == 0x00) {	/* SUB  SP,# */
				outab(0x52);
				outrb(&e1, R_USGN);
				break;
			} else
			if (op == 0x0B) {	/* ADD  SP,# */
				outab(0x5B);
				outrb(&e1, R_USGN);
				break;
			}
		}
		if ((t2 != S_REG) || (v2 != A)) {
			opcy_aerr();
			break;
		}
		switch(t1) {
		case S_REG:	/* A, X, XL, XH, Y, YL, YH, CC, SP */
			opcy_aerr();
			break;
		case S_LONG:	/*  arg */
			if (ls_mode(&e1)) {
				outab(op | 0xC0);
				outrw(&e1, R_USGN);
			} else {
		case S_SHORT:	/* *arg */
				outab(op | 0xB0);
				outrb(&e1, R_USGN);
			}
			break;
		case S_IMM:	/* #arg */
			outab(op | 0xA0);
			outrb(&e1, R_NORM);
			break;
		case S_IXO:	/* (offset,R), R = X, Y, SP */
			if (ls_mode(&e1)) {
		case S_IXE:	/* (offset,R).e, R = X, Y, SP */
				if (t1 == S_IXE) { aerr(); }
		case S_IXW:	/* (offset,R).w, R = X, Y, SP */
				switch(v1) {
				case Y:		outab(0x90);
				case X:		outab(op | 0xD0);
						outrw(&e1, R_USGN);	break;
				case SP:	if (t1 == S_IXW) { aerr(); }
						if (e1.e_addr & ~0xFF) { aerr(); }
						outab(op | 0x10);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			} else {
		case S_IXB:	/* (offset,R).b, R = X, Y, SP */
				switch(v1) {
				case Y:		outab(0x90);
				case X:		outab(op | 0xE0);
						outrb(&e1, R_USGN);	break;
				case SP:	outab(op | 0x10);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			}
			break;
		case S_IX:	/* (R), R = X, Y */
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op | 0xF0);	break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_IN:	/* [offset] */
			if (ls_mode(&e1)) {
		case S_INE:	/* [offset].e */
				if (t1 == S_INE) { aerr(); }
		case S_INW:	/* [offset].w */
				outab(0x72);
				outab(op | 0xC0);
				outrw(&e1, R_USGN);
			} else {
		case S_INB:	/* [offset].b */
				outab(0x92);
				outab(op | 0xC0);
				outrb(&e1, R_USGN);
			}
			break;
		case S_INIX:	/* ([offset],R), R = X, Y */
			if (ls_mode(&e1)) {
		case S_INIXE:	/* ([offset],R).e, R = X, Y */
				if (t1 == S_INIXE) { aerr(); }
		case S_INIXW:	/* ([offset],R).w, R = X, Y */
				switch(v1) {
				case X:		outab(0x72);
						outab(op | 0xD0);
						outrw(&e1, R_USGN);	break;
				case Y:	        if (t1 == S_INIXW) { aerr(); }
						outab(0x91);
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			} else {
		case S_INIXB:	/* ([offset],R).b, R = X, Y */
				switch(v1) {
				case X:
				case Y:		switch(v1) {
						case X:		outab(0x92);	break;
						case Y:		outab(0x91);	break;
						default:			break;
						}
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;

	/*
	 * S_ADDW:
	 *	ADDW
	 */
	case S_ADDW:
		t2 = addr(&e2);
		v2 = rcode;
		comma(1);
		t1 = addr(&e1);
		v1 = rcode;
		if ((t2 != S_REG) || ((v2 != X) && (v2 != Y) && (v2 != SP))) {
			opcy_aerr();
			break;
		}
		switch(t1) {
		case S_LONG:	/*  arg */
		case S_SHORT:	/* *arg */
			outab(0x72);
			switch(v2) {
			case X:		outab(0xBB);	break;
			case Y:		outab(0xB9);	break;
			case SP:	opcy_aerr();	break;
			default:			break;
			}
			outrw(&e1, R_USGN);
			break;
		case S_IMM:	/* #arg */
			switch(v2) {
			case X:		outab(0x1C);	break;
			case Y:		outab(0x72);
					outab(0xA9);	break;
			case SP:	outab(0x5B);	break;
			default:			break;
			}
			if(v2 == SP)	outab(e1.e_addr); // byte
			else		outrw(&e1, R_NORM); // word
			break;
		case S_IXE:	/* (offset,R).e, R = SP */
		case S_IXW:	/* (offset,R).w, R = SP */
			aerr();
		case S_IXB:	/* (offset,R).b, R = SP */
		case S_IXO:	/* (offset,R), R = SP */
			if (v1 == SP) {
				outab(0x72);
				switch(v2) {
				case X:		outab(0xFB);	break;
				case Y:		outab(0xF9);	break;
				default:			break;
				}
				outrb(&e1, R_USGN);	break;
			} else {
				opcy_aerr();
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;

	/*
	 * S_SUBW:
	 *	SUBW
	 */
	case S_SUBW:
		t2 = addr(&e2);
		v2 = rcode;
		comma(1);
		t1 = addr(&e1);
		v1 = rcode;
		if ((t2 != S_REG) || ((v2 != X) && (v2 != Y))) {
			opcy_aerr();
			break;
		}
		switch(t1) {
		case S_LONG:	/*  arg */
		case S_SHORT:	/* *arg */
			outab(0x72);
			switch(v2) {
			case X:		outab(0xB0);	break;
			case Y:		outab(0xB2);	break;
			default:			break;
			}
			outrw(&e1, R_USGN);
			break;
		case S_IMM:	/* #arg */
			switch(v2) {
			case X:		outab(0x1D);	break;
			case Y:		outab(0x72);
					outab(0xA2);	break;
			default:			break;
			}
			outrw(&e1, R_NORM);
			break;
		case S_IXE:	/* (offset,R).e, R = SP */
		case S_IXW:	/* (offset,R).w, R = SP */
			aerr();
		case S_IXB:	/* (offset,R).b, R = SP */
		case S_IXO:	/* (offset,R), R = SP */
			if (v1 == SP) {
				outab(0x72);
				switch(v2) {
				case X:		outab(0xF0);	break;
				case Y:		outab(0xF2);	break;
				default:			break;
				}
				outrb(&e1, R_USGN);	break;
			} else {
				opcy_aerr();
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;

	/*
	 * S_CPW:
	 *	CPW
	 */
	case S_CPW:
		t2 = addr(&e2);
		v2 = rcode;
		comma(1);
		t1 = addr(&e1);
		v1 = rcode;
		if ((t2 != S_REG) || ((v2 != X) && (v2 != Y))) {
			opcy_aerr();
			break;
		}
		if (v2 == v1) {
			opcy_aerr();
			break;
		}
		switch(t1) {
		case S_LONG:	/*  arg */
			if (ls_mode(&e1)) {
				switch(v2) {
				case Y:		outab(0x90);
				case X:		outab(0xC3);	break;
				default:			break;
				}
				outrw(&e1, R_USGN);
			} else {
		case S_SHORT:	/* *arg */
				switch(v2) {
				case Y:		outab(0x90);
				case X:		outab(0xB3);	break;
				default:			break;
				}
				outrb(&e1, R_USGN);
			}
			break;
		case S_IMM:	/* #arg */
			switch(v2) {
			case Y:		outab(0x90);
			case X:		outab(0xA3);	break;
			default:			break;
			}
			outrw(&e1, R_NORM);
			break;
		case S_IXE:	/* (offset,R).e, R = X, Y, SP */
			aerr();
		case S_IXW:	/* (offset,R).w, R = X, Y, SP */
		case S_IXB:	/* (offset,R).b, R = X, Y, SP */
		case S_IXO:	/* (offset,R), R = X, Y, SP */
			if ((v2 == Y) && (v1 == SP)) {
				opcy_aerr();
				break;
			}
			switch(t1) {
			case S_IXO:	/* (offset,R), R = X, Y, SP */
				if (ls_mode(&e1)) {
			case S_IXE:	/* (offset,R).e, R = X, Y, SP */
					if (t1 == S_IXE) { aerr(); }
			case S_IXW:	/* (offset,R).w, R = X, Y, SP */
					switch(v1) {
					case Y:		outab(0x90);
					case X:		outab(op | 0xD0);
							outrw(&e1, R_USGN);	break;
					case SP:	if (t1 == S_IXW) { aerr(); }
							outab(op | 0x10);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_IXB:	/* (offset,R).b, R = X, Y, SP */
					switch(v1) {
					case Y:		outab(0x90);
					case X:		outab(op | 0xE0);
							outrb(&e1, R_USGN);	break;
					case SP:	outab(op | 0x10);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
			}
			break;
		case S_IX:	/* (R), R = X, Y */
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op | 0xF0);	break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_IN:	/* [offset] */
			if (ls_mode(&e1)) {
		case S_INE:	/* [offset].e */
				if (t1 == S_INE) { aerr(); }
		case S_INW:	/* [offset].w */
				switch(v2) {
				case X:		outab(0x72);
						outab(0xC3);
						outrw(&e1, R_USGN);	break;
				case Y:	        if (t1 == S_INW) { aerr(); }
						outab(0x91);
						outab(0xC3);
						outrb(&e1, R_USGN);	break;
				default:				break;
				}
			} else {
		case S_INB:	/* [offset].b */
				switch(v2) {
				case X:		outab(0x92);	break;
				case Y:		outab(0x91);	break;
				default:			break;
				}
				outab(0xC3);
				outrb(&e1, R_USGN);
			}
			break;
		case S_INIX:	/* ([offset],R), R = X, Y */
			if (ls_mode(&e1)) {
		case S_INIXE:	/* ([offset],R).e, R = X, Y */
				if (t1 == S_INIXE) { aerr(); }
		case S_INIXW:	/* ([offset],R).w, R = X, Y */
				switch(v1) {
				case X:		outab(0x72);
						outab(op | 0xD0);
						outrw(&e1, R_USGN);	break;
				case Y:	        if (t1 == S_INIXW) { aerr(); }
						outab(0x91);
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			} else {
		case S_INIXB:	/* ([offset],R).b, R = X, Y */
				switch(v1) {
				case X:
				case Y:		switch(v1) {
						case X:		outab(0x92);	break;
						case Y:		outab(0x91);	break;
						default:			break;
						}
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;

