lronaldo/cpctelera/cpctelera/tools/sdcc-3.9.3-r11351/src/sdas/asstm8/stm8mch.c
	/*
	 * S_LDF:
	 *	LDF  A,---
	 *	LDF  ---,A
	 */
	case S_LDF:
		t2 = addr(&e2);
		v2 = rcode;
		comma(1);
		t1 = addr(&e1);
		v1 = rcode;
		/*
		 * LD  A,---
		 */
		if ((t2 == S_REG) && (v2 == A)) {
			op = 0x0C;
		} else
		/*
		 * LD  ---,A
		 */
		if ((t1 == S_REG) && (v1 == A)) {
			op = 0x0D;
			p1 = (char *) &e1;
			p2 = (char *) &e2;
			for (v3=0; v3<sizeof(e1); p1++,p2++,v3++) {
				 t3 = (int) *p2;
				*p2 = *p1;
				*p1 = (char) t3;
			}
			v1 = v2;
			t1 = t2;
		} else {
			opcy_aerr();
			break;
		}
		switch(t1) {
		case S_LONG:	/*  arg */
		case S_SHORT:	/* *arg */
			outab(op | 0xB0);
			outr3b(&e1, R_NORM);
			break;
		case S_IXB:	/* (offset,R).b, R = X, Y */
		case S_IXW:	/* (offset,R).w, R = X, Y */
			aerr();
		case S_IXE:	/* (offset,R).e, R = X, Y */
		case S_IXO:	/* (offset,R), R = X, Y */
			switch(op) {
			case 0x0C:	op = 0xAF;	break;
			case 0x0D:	op = 0xA7;	break;
			default:			break;
			}
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op);
					outr3b(&e1, R_NORM);	break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_INB:	/* [offset].b */
		case S_INW:	/* [offset].w */
			aerr();
		case S_INE:	/* [offset].e */
		case S_IN:	/* [offset] */
			outab(0x92);
			outab(op | 0xB0);
			outrw(&e1, R_USGN);
			break;
		case S_INIXB:	/* ([offset],R).b, R = X, Y */
		case S_INIXW:	/* ([offset],R).w, R = X, Y */
			aerr();
		case S_INIXE:	/* ([offset],R).e, R = X, Y */
		case S_INIX:	/* ([offset],R), R = X, Y */
			switch(op) {
			case 0x0C:	op = 0xAF;	break;
			case 0x0D:	op = 0xA7;	break;
			default:			break;
			}
			switch(v1) {
			case X:		outab(0x92);
					outab(op);
					outrw(&e1, R_USGN);	break;
			case Y:		outab(0x91);
					outab(op);
					outrw(&e1, R_USGN);	break;
			default:	opcy_aerr();		break;
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;

	/*
	 * S_LDW:
	 *	LDW
	 */
	case S_LDW:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if ((t1 == S_REG) && (t2 == S_REG)) {
			switch(v1) {	/* x,--- or y,--- or sp,--- */
			case X:
				switch(v2) {	/* ---,x or ---,y or ---,sp */
				case Y:		outab(0x93);	break;
				case SP:	outab(0x96);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case Y:
				outab(0x90);
				switch(v2) {	/* ---,x or ---,y or ---,sp */
				case X:		outab(0x93);	break;
				case SP:	outab(0x96);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case SP:
				switch(v2) {	/* ---,x or ---,y or ---,sp */
				case Y:		outab(0x90);
				case X:		outab(0x94);	break;
				default:	opcy_aerr();	break;
				}
				break;
			default:	opcy_aerr();	break;
			}
			break;
		}
		if ((t1 == S_REG) && (v1 == X)) {
			switch(t2) {
			case S_LONG:	/*  arg */
				if (ls_mode(&e2)) {
					outab(0xCE);
					outrw(&e2, R_USGN);	break;
				} else {
			case S_SHORT:	/* *arg */
					outab(0xBE);
					outrb(&e2, R_USGN);	break;
				}
			case S_IMM:	/* #arg */
				outab(0xAE);
				outrw(&e2, R_NORM);	break;
			case S_IXO:	/* (offset,R), R = X, SP */
				if (ls_mode(&e2)) {
			case S_IXE:	/* (offset,R).e, R = X, SP */
					if (t2 == S_IXE) { aerr(); }
			case S_IXW:	/* (offset,R).w, R = X, SP */
					switch(v2) {
					case X:		outab(0xDE);
							outrw(&e2, R_USGN);	break;
					case SP:	if (t2 == S_IXW) { aerr(); }
							outab(0x1E);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_IXB:	/* (offset,R).b, R = X, SP */
					switch(v2) {
					case X:		outab(0xEE);
							outrb(&e2, R_USGN);	break;
					case SP:	outab(0x1E);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			case S_IX:	/* (R), R = X */
				switch(v2) {
				case X:		outab(0xFE);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case S_IN:	/* [offset] */
				if (ls_mode(&e2)) {
			case S_INE:	/* [offset].e */
					if (t2 == S_INE) { aerr(); }
			case S_INW:	/* [offset].w */
					outab(0x72);
					outab(0xCE);
					outrw(&e2, R_USGN);
				} else {
			case S_INB:	/* [offset].b */
					outab(0x92);
					outab(0xCE);
					outrb(&e2, R_USGN);
				}
				break;
			case S_INIX:	/* ([offset],R), R = X */
				if (ls_mode(&e2)) {
			case S_INIXE:	/* ([offset],R).e, R = X */
					if (t2 == S_INIXE) { aerr(); }
			case S_INIXW:	/* ([offset],R).w, R = X */
					switch(v2) {
					case X:		outab(0x72);
							outab(0xDE);
							outrw(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_INIXB:	/* ([offset],R).b, R = X */
					switch(v2) {
					case X:		outab(0x92);
							outab(0xDE);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			default:
				opcy_aerr();
				break;
			}
			break;
		} else
		if ((t1 == S_REG) && (v1 == Y)) {
			switch(t2) {
			case S_LONG:	/*  arg */
				if (ls_mode(&e2)) {
					outab(0x90);
					outab(0xCE);
					outrw(&e2, R_USGN);	break;
				} else {
			case S_SHORT:	/* *arg */
					outab(0x90);
					outab(0xBE);
					outrb(&e2, R_USGN);	break;
				}
			case S_IMM:	/* #arg */
				outab(0x90);
				outab(0xAE);
				outrw(&e2, R_NORM);	break;
			case S_IXO:	/* (offset,R), R = Y, SP */
				if (ls_mode(&e2)) {
			case S_IXE:	/* (offset,R).e, R = Y, SP */
					if (t2 == S_IXE) { aerr(); }
			case S_IXW:	/* (offset,R).w, R = Y, SP */
					switch(v2) {
					case Y:	        outab(0x90);
							outab(0xDE);
							outrw(&e2, R_USGN);	break;
					case SP:	if (t2 == S_IXW) { aerr(); }
							outab(0x16);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_IXB:	/* (offset,R).b, R = Y, SP */
					switch(v2) {
					case Y:	        outab(0x90);
							outab(0xEE);
							outrb(&e2, R_USGN);	break;
					case SP:	outab(0x16);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			case S_IX:	/* (R), R = Y */
				switch(v2) {
				case Y:	        outab(0x90);
						outab(0xFE);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case S_IN:	/* [offset] */
				if (ls_mode(&e2)) {
			case S_INE:	/* [offset].e */
					if (t2 == S_INE) { aerr(); }
			case S_INW:	/* [offset].w */
					if (t2 == S_INW) { aerr(); }
					outab(0x91);
					outab(0xCE);
					outrb(&e2, R_USGN);
				} else {
			case S_INB:	/* [offset].b */
					outab(0x91);
					outab(0xCE);
					outrb(&e2, R_USGN);
				}
				break;
			case S_INIX:	/* ([offset],R), R = Y */
				if (ls_mode(&e2)) {
			case S_INIXE:	/* ([offset],R).e, R = Y */
					if (t2 == S_INIXE) { aerr(); }
			case S_INIXW:	/* ([offset],R).w, R = Y */
					switch(v2) {
					case Y:	        if (t2 == S_INIXW) { aerr(); }
							outab(0x91);
							outab(0xDE);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_INIXB:	/* ([offset],R).b, R = Y */
					switch(v2) {
					case Y:		outab(0x91);
							outab(0xDE);
							outrb(&e2, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			default:
				opcy_aerr();
				break;
			}
			break;
		} else
		if ((t2 == S_REG) && (v2 == X)) {
			switch(t1) {
			case S_LONG:	/*  arg */
				if (ls_mode(&e1)) {
					outab(0xCF);
					outrw(&e1, R_USGN);	break;
				} else {
			case S_SHORT:	/* *arg */
					outab(0xBF);
					outrb(&e1, R_USGN);	break;
				}
			case S_IXO:	/* (offset,R), R = Y, SP */
				if (ls_mode(&e1)) {
			case S_IXE:	/* (offset,R).e, R = Y, SP */
					if (t1 == S_IXE) { aerr(); }
			case S_IXW:	/* (offset,R).w, R = Y, SP */
					switch(v1) {
					case Y:	        outab(0x90);
							outab(0xDF);
							outrw(&e1, R_USGN);	break;
					case SP:	if (t1 == S_IXW) { aerr(); }
							outab(0x1F);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_IXB:	/* (offset,R).b, R = Y, SP */
					switch(v1) {
					case Y:	        outab(0x90);
							outab(0xEF);
							outrb(&e1, R_USGN);	break;
					case SP:	outab(0x1F);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			case S_IX:	/* (R), R = Y */
				switch(v1) {
				case Y:	        outab(0x90);
						outab(0xFF);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case S_IN:	/* [offset] */
				if (ls_mode(&e1)) {
			case S_INE:	/* [offset].e */
					if (t1 == S_INE) { aerr(); }
			case S_INW:	/* [offset].w */
					outab(0x72);
					outab(0xCF);
					outrw(&e1, R_USGN);
				} else {
			case S_INB:	/* [offset].b */
					outab(0x92);
					outab(0xCF);
					outrb(&e1, R_USGN);
				}
				break;
			case S_INIX:	/* ([offset],R), R = Y */
				if (ls_mode(&e1)) {
			case S_INIXE:	/* ([offset],R).e, R = Y */
					if (t1 == S_INIXE) { aerr(); }
			case S_INIXW:	/* ([offset],R).w, R = Y */
					switch(v1) {
					case Y:	        if (t1 == S_INIXW) { aerr(); }
							outab(0x91);
							outab(0xDF);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_INIXB:	/* ([offset],R).b, R = Y */
					switch(v1) {
					case Y:		outab(0x91);
							outab(0xDF);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			default:
				opcy_aerr();
				break;
			}
			break;
		} else
		if ((t2 == S_REG) && (v2 == Y)) {
			switch(t1) {
			case S_LONG:	/*  arg */
				if (ls_mode(&e1)) {
					outab(0x90);
					outab(0xCF);
					outrw(&e1, R_USGN);	break;
				} else {
			case S_SHORT:	/* *arg */
					outab(0x90);
					outab(0xBF);
					outrb(&e1, R_USGN);	break;
				}
			case S_IXO:	/* (offset,R), R = X, SP */
				if (ls_mode(&e1)) {
			case S_IXE:	/* (offset,R).e, R = X, SP */
					if (t1 == S_IXE) { aerr(); }
			case S_IXW:	/* (offset,R).w, R = X, SP */
					switch(v1) {
					case X:		outab(0xDF);
							outrw(&e1, R_USGN);	break;
					case SP:	if (t1 == S_IXW) { aerr(); }
							outab(0x17);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_IXB:	/* (offset,R).b, R = X, SP */
					switch(v1) {
					case X:		outab(0xEF);
							outrb(&e1, R_USGN);	break;
					case SP:	outab(0x17);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			case S_IX:	/* (R), R = X */
				switch(v1) {
				case X:		outab(0xFF);	break;
				default:	opcy_aerr();	break;
				}
				break;
			case S_IN:	/* [offset] */
				if (ls_mode(&e1)) {
			case S_INE:	/* [offset].e */
					if (t1 == S_INE) { aerr(); }
			case S_INW:	/* [offset].w */
					if (t1 == S_INW) { aerr(); }
					outab(0x91);
					outab(0xCF);
					outrb(&e1, R_USGN);
				} else {
			case S_INB:	/* [offset].b */
					outab(0x91);
					outab(0xCF);
					outrb(&e1, R_USGN);
				}
				break;
			case S_INIX:	/* ([offset],R), R = X */
				if (ls_mode(&e1)) {
			case S_INIXE:	/* ([offset],R).e, R = X */
					if (t1 == S_INIXE) { aerr(); }
			case S_INIXW:	/* ([offset],R).w, R = X */
					switch(v1) {
					case X:		outab(0x72);
							outab(0xDF);
							outrw(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				} else {
			case S_INIXB:	/* ([offset],R).b, R = X */
					switch(v1) {
					case X:		outab(0x92);
							outab(0xDF);
							outrb(&e1, R_USGN);	break;
					default:	opcy_aerr();		break;
					}
				}
				break;
			default:
				opcy_aerr();
				break;
			}
			break;
		}
		opcy_aerr();
		break;

