lronaldo/cpctelera/cpctelera/tools/sdcc-3.9.3-r11351/src/sdas/asstm8/stm8mch.c
	/*
	 * S_MOV:
	 *	MOV
	 */
	case S_MOV:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if (t1 == S_LONG) {
			t1 = ls_mode(&e1) ? S_LONG : S_SHORT;
		}
		if (t2 == S_LONG) {
			t2 = ls_mode(&e2) ? S_LONG : S_SHORT;
		}
		switch(t1) {
		case S_LONG:
			switch(t2) {
			case S_IMM:	outab(0x35);
					outrb(&e2, R_NORM);     valu_aerr(&e2, 1);
					outrw(&e1, R_USGN);	break;
			case S_SHORT:
			case S_LONG:	outab(0x55);
					outrw(&e2, R_USGN);
					outrw(&e1, R_USGN);	break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_SHORT:
			switch(t2) {
			case S_IMM:	outab(0x35);
					outrb(&e2, R_NORM);     valu_aerr(&e2, 1);
					outrw(&e1, R_USGN);	break;
			case S_SHORT:	outab(0x45);
					outrb(&e2, R_USGN);
					outrb(&e1, R_USGN);	break;
			case S_LONG:	outab(0x55);
					outrw(&e2, R_USGN);
					outrw(&e1, R_USGN);	break;
			default:	opcy_aerr();		break;
			}
			break;
		default:	opcy_aerr();	break;
		}
		break;

	case S_WOP:
		t1 = addr(&e1);
		v1 = rcode;
		if (t1 == S_REG) {
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op);	break;
			default:	opcy_aerr();	break;
			}
		} else {
			opcy_aerr();
		}
		break;

	case S_RWA:
		t1 = addr(&e1);
		v1 = rcode;
		if(t1 != S_REG) {
			opcy_aerr();
			break;
		}
		switch(v1) {
		case Y:		outab(0x90);
		case X:		outab(op);	break;
		default:	opcy_aerr();	break;
		}
		break;

	case S_EXG:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if ((t1 == S_REG) && (v1 == A)) {
			switch(t2) {
			case S_SHORT:
			case S_LONG:	outab(op | 0x30);
					outrw(&e2, R_USGN);	break;
			case S_REG:
				switch(v2) {
				case XL:	outab(op | 0x40);	break;
				case YL:	outab(op | 0x60);	break;
				default:	opcy_aerr();		break;
				}
				break;
			default:	opcy_aerr();		break;
			}
		} else {
			opcy_aerr();
		}
		break;

	case S_MLDV:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if ((t2 != S_REG) && (v2 != A)) {
			opcy_aerr();
			break;
		}
		if (t1 == S_REG) {
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op);	break;
			default:	opcy_aerr();	break;
			}
		} else {
			opcy_aerr();
		}
		break;

	case S_DIVW:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if (((t1 == S_REG) && (v1 == X)) &&
		    ((t2 == S_REG) && (v2 == Y))) {
			outab(0x65);
		} else {
			opcy_aerr();
		}
		break;

	case S_EXGW:
		t1 = addr(&e1);
		v1 = rcode;
		comma(1);
		t2 = addr(&e2);
		v2 = rcode;
		if ((t1 == S_REG) && (t2 == S_REG)) {
			if (((v1 == X) && (v2 == Y)) ||
			    ((v1 == Y) && (v2 == X))) {
				outab(op);
				break;
			}
		}
		opcy_aerr();
		break;

	case S_POP:
		t1 = addr(&e1);
		v1 = rcode;
		switch(t1) {
		case S_REG:
			switch(v1) {
			case A:		outab(0x84);		break;
			case CC:	outab(0x86);		break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_SHORT:
		case S_LONG:		outab(op);
					outrw(&e1, R_USGN);	break;
		default:		opcy_aerr();		break;
		}
		break;

	case S_PUSH:
		t1 = addr(&e1);
		v1 = rcode;
		switch(t1) {
		case S_REG:
			switch(v1) {
			case A:		outab(0x88);		break;
			case CC:	outab(0x8A);		break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_SHORT:
		case S_LONG:		outab(op);
					outrw(&e1, R_USGN);	break;
		case S_IMM:		outab(0x4B);
					outrb(&e1, R_NORM);	break;
		default:		opcy_aerr();		break;
		}
		break;

	case S_PW:
		t1 = addr(&e1);
		v1 = rcode;
		switch(t1) {
		case S_REG:
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op);		break;
			default:	opcy_aerr();		break;
			}
			break;
		default:		opcy_aerr();		break;
		}
		break;

	/*
	 * S_CLJP:
	 *	CALL, JP
	 */
	case S_CLJP:
		t1 = addr(&e1);
		v1 = rcode;
		switch(t1) {
		case S_LONG:	/*  arg */
		case S_SHORT:	/* *arg */
			outab(op | 0xC0);
			outrw(&e1, R_NORM);
			break;
		case S_IXO:	/* (offset,R), R = X, Y */
			if (ls_mode(&e1)) {
		case S_IXE:	/* (offset,R).e, R = X, Y */
				if (t1 == S_IXE) { aerr(); }
		case S_IXW:	/* (offset,R).w, R = X, Y */
				switch(v1) {
				case Y:		outab(0x90);
				case X:		outab(op | 0xD0);
						outrw(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			} else {
		case S_IXB:	/* (offset,R).b, R = X, Y */
				switch(v1) {
				case Y:		outab(0x90);
				case X:		outab(op | 0xE0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			}
			break;
		case S_IX:	/* (R), R = X, Y */
			switch(v1) {
			case Y:		outab(0x90);
			case X:		outab(op | 0xF0);	break;
			default:	opcy_aerr();		break;
			}
			break;
		case S_IN:	/* [offset] */
			if (ls_mode(&e1)) {
		case S_INE:	/* [offset].e */
				if (t1 == S_INE) { aerr(); }
		case S_INW:	/* [offset].w */
				outab(0x72);
				outab(op | 0xC0);
				outrw(&e1, R_USGN);
			} else {
		case S_INB:	/* [offset].b */
				outab(0x92);
				outab(op | 0xC0);
				outrb(&e1, R_USGN);
			}
			break;
		case S_INIX:	/* ([offset],R), R = X, Y */
			if (ls_mode(&e1)) {
		case S_INIXE:	/* ([offset],R).e, R = X, Y */
				if (t1 == S_INIXE) { aerr(); }
		case S_INIXW:	/* ([offset],R).w, R = X, Y */
				switch(v1) {
				case X:		outab(0x72);
						outab(op | 0xD0);
						outrw(&e1, R_USGN);	break;
				case Y:		if (t1 == S_INIXW) { aerr(); }
						outab(0x91);
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			} else {
		case S_INIXB:	/* ([offset],R).b, R = X, Y */
				switch(v1) {
				case X:
				case Y:		switch(v1) {
						case X:		outab(0x92);	break;
						case Y:		outab(0x91);	break;
						default:			break;
						}
						outab(op | 0xD0);
						outrb(&e1, R_USGN);	break;
				default:	opcy_aerr();		break;
				}
			}
			break;
		default:
			opcy_aerr();
			break;
		}
		break;


	/*
	 * S_CLJPF:
	 *	CALLF, JPF
	 */
	case S_CLJPF:
		t1 = addr(&e1);
		v1 = rcode;
		switch(t1) {
		case S_SHORT:
		case S_LONG:	outab(op);
				outr3b(&e1, R_NORM);	break;
		case S_INB:	/* [offset].b */
		case S_INW:	/* [offset].w */
			aerr();
		case S_INE:	/* [offset].e */
		case S_IN:	/* [offset] */
				outab(0x92);
				outab(op);
				outrw(&e1, R_USGN);	break;
		default:	opcy_aerr();		break;
		}
		break;

